targets/spoke-rewired/artillery-scripts/autoassign.yml
# Full documentation of Artillery at:
# https://artillery.io/docs/
---
config:
  target: "{{ $processEnvironment.BASE_URL }}"
  payload:
    path: "{{ $processEnvironment.AUTOASSIGN_CSV_PATH }}"
    fields:
      - "auth_username"
      - "auth_password"
      - "request_slack_id"
      - "request_count"
    order: sequence
  phases:
    - duration: 300
      arrivalCount: 300

scenarios:
  - flow:
      - post:
          url: "/autoassign"
          header:
            Content-Type: "application/json"
          # Auth is undocumented:
          # https://github.com/artilleryio/artillery/issues/211#issuecomment-262598511
          auth:
            user: "{{ auth_username }}"
            pass: "{{ auth_password }}"
          json:
            slack_id: {{ request_slack_id }}
            count: {{ request_count }}